In [3]:
import sqlite3

working with data base with SQL (Structured query language)
1. Create a connection object
2. create a cursor object from the connection object.
3. using the cursor method call the execute method with create table query as the parameter

# Create Database

In [4]:
#Student databse will be created in jupyter home page
#First conncetion object.
db=sqlite3.connect('student_databse.db')

In [5]:
#create cursor object from connection 

cur=db.cursor()

# Craete table in student_database

In [5]:
cur.execute("create table student(id int primary key,name text,marks int)")

# Insert data in student table

In [8]:
cur.execute("insert into student(id,name,marks) values(1,'Ram',90)")
db.commit()

In [9]:
print(cur.rowcount,"Record(s) inserted")

1 Record(s) inserted

In [10]:
cur.execute("insert into student(id,name,marks) values(2,'Shalu',100)")
db.commit()

In [13]:
results=cur.execute("select* from student")
for row in results:
        print(row)

(1, 'Ram', 90)
(2, 'Shalu', 100)

In [14]:
cur.execute("insert into student values(3,'Bulbul',05)")
db.commit()

In [15]:
results=cur.execute("select * from student")
for row in results:
    print(row)

(1, 'Ram', 90)
(2, 'Shalu', 100)
(3, 'Bulbul', 5)

In [16]:
cur.execute("insert into student values(4,'Abhilash',10)")
db.commit()

In [17]:
results=cur.execute("select * from student")
for row in results:
    print(row)

(1, 'Ram', 90)
(2, 'Shalu', 100)
(3, 'Bulbul', 5)
(4, 'Abhilash', 10)

In [18]:
cur.execute("insert into student values(5,'Siddharth',99)")
db.commit()

In [19]:
results=cur.execute("select * from student")
for row in results:
    print(row)

(1, 'Ram', 90)
(2, 'Shalu', 100)
(3, 'Bulbul', 5)
(4, 'Abhilash', 10)
(5, 'Siddharth', 99)

In [4]:
cur.execute("insert into student values(6,'Mummy',40)")
db.commit()

IntegrityError: UNIQUE constraint failed: student.id

In [6]:
results=cur.execute("select * from student")
for row in results:
    print(row)

(1, 'Ram', 90)
(2, 'Shalu', 100)
(3, 'Bulbul', 5)
(4, 'Abhilash', 10)
(5, 'Siddharth', 99)
(6, 'Mummy', 40)

In [7]:
#multiple record insertion

cur.execute("insert into student values (7,'Kiara',75),(8,'Jack',94)")
db.commit

#count of records inserted
print(cur.rowcount,"Record's inserted")

2 Record's inserted

In [8]:
db1=sqlite3.connect("C:/MySQlite_Databse/studentdb.db")

In [9]:
cur1=db1.cursor()

In [11]:
cur1.execute("create table employee (id int,name text,age int)")

In [13]:
cur1.execute("insert into employee values (1,'Melina',32)")
db1.commit()

In [14]:
print(cur1.rowcount,"Record's inserted")

1 Record's inserted

In [15]:
results=cur1.execute("select * from employee")

In [16]:
for row in results:
    print(row)

(1, 'Melina', 32)

In [17]:
cur1.execute("insert into employee values (2,'Shlok',54)")
db1.commit()

In [18]:
print(cur1.rowcount,"Record's inserted")

1 Record's inserted

In [19]:
results=cur1.execute("select * from employee")
for row in results:
    print(row)

(1, 'Melina', 32)
(2, 'Shlok', 54)

# Accessing the data stored in SQlite using Python

In [23]:
results=cur.execute("select * from student")
for i in results:
    print(i)

(1, 'Ram', 90)
(2, 'Shalu', 100)
(3, 'Bulbul', 5)
(4, 'Abhilash', 10)
(5, 'Siddharth', 99)
(6, 'Mummy', 40)
(7, 'Kiara', 75)
(8, 'Jack', 94)
(9, 'Alok', 79)
(10, 'Babubhaiya', 99)

In [25]:
results=cur.execute('select id,name from student')
for i in results:
    print(i)

(1, 'Ram')
(2, 'Shalu')
(3, 'Bulbul')
(4, 'Abhilash')
(5, 'Siddharth')
(6, 'Mummy')
(7, 'Kiara')
(8, 'Jack')
(9, 'Alok')
(10, 'Babubhaiya')

In [28]:
results=cur.execute('select id,marks from student')
for i in results:
    print(i)

(1, 90)
(2, 100)
(3, 5)
(4, 10)
(5, 99)
(6, 40)
(7, 75)
(8, 94)
(9, 79)
(10, 99)

In [29]:
results=cur.execute("select * from student where id=8")
for i in results:
    print(i)

(8, 'Jack', 94)

In [30]:
results=cur.execute("select * from student where id=5")
for i in results:
    print(i)

(5, 'Siddharth', 99)

In [31]:
results=cur.execute("select * from student where id=3")
for i in results:
    print(i)

(3, 'Bulbul', 5)

In [32]:
results=cur.execute("select * from student limit 4")
for i in results:
    print(i)

(1, 'Ram', 90)
(2, 'Shalu', 100)
(3, 'Bulbul', 5)
(4, 'Abhilash', 10)

In [33]:
results=cur.execute("select * from student limit 6")
for i in results:
    print(i)

(1, 'Ram', 90)
(2, 'Shalu', 100)
(3, 'Bulbul', 5)
(4, 'Abhilash', 10)
(5, 'Siddharth', 99)
(6, 'Mummy', 40)

In [34]:
results=cur.execute("select name from student where id=10")
for i in results:
    print(i)

('Babubhaiya',)

In [35]:
results=cur.execute("select marks from student where id=10")
for i in results:
    print(i)

(99,)

In [36]:
results=cur.execute("select * from student where name='Bulbul'")
for i in results:
    print(i)

(3, 'Bulbul', 5)

In [37]:
# and = * , or = +
results=cur.execute("select name from student where marks>60 and marks<90")
for i in results:
    print(i)

('Kiara',)
('Alok',)

In [40]:
results=cur.execute("select name from student where marks>40 and marks<80")
for i in results:
    print(i)

('Kiara',)
('Alok',)

In [7]:
#fetchall will display all rows

results=cur.execute("select * from student")
results.fetchall()

[(1, 'Ram', 90),
 (2, 'Shalu', 100),
 (3, 'Bulbul', 5),
 (4, 'Abhilash', 10),
 (5, 'Siddharth', 99),
 (6, 'Mummy', 40)]

In [42]:
results=cur.execute("select * from student order by name asc")
for i in results:
    print(i)

(4, 'Abhilash', 10)
(9, 'Alok', 79)
(10, 'Babubhaiya', 99)
(3, 'Bulbul', 5)
(8, 'Jack', 94)
(7, 'Kiara', 75)
(6, 'Mummy', 40)
(1, 'Ram', 90)
(2, 'Shalu', 100)
(5, 'Siddharth', 99)

In [43]:
results=cur.execute("select * from student order by name desc")
for i in results:
    print(i)

(5, 'Siddharth', 99)
(2, 'Shalu', 100)
(1, 'Ram', 90)
(6, 'Mummy', 40)
(7, 'Kiara', 75)
(8, 'Jack', 94)
(3, 'Bulbul', 5)
(10, 'Babubhaiya', 99)
(9, 'Alok', 79)
(4, 'Abhilash', 10)

In [44]:
results=cur.execute("select * from student order by name desc")
results.fetchall()

[(5, 'Siddharth', 99),
 (2, 'Shalu', 100),
 (1, 'Ram', 90),
 (6, 'Mummy', 40),
 (7, 'Kiara', 75),
 (8, 'Jack', 94),
 (3, 'Bulbul', 5),
 (10, 'Babubhaiya', 99),
 (9, 'Alok', 79),
 (4, 'Abhilash', 10)]

In [46]:
results=cur.execute("select * from student where name='Siddharth' and marks=99")
for i in results:
    print(i)

(5, 'Siddharth', 99)

In [47]:
results=cur.execute("select * from student where name='Siddharth' and marks=90")
for i in results:
    print(i)

In [48]:
results=cur.execute("select * from student where name='Alok' and marks=79")
for i in results:
    print(i)

(9, 'Alok', 79)

In [49]:
results=cur.execute("select * from student where name='Alok' or marks=59")
for i in results:
    print(i)

(9, 'Alok', 79)

In [50]:
results=cur.execute("select * from student where id=2 or marks=99")
for i in results:
    print(i)

(2, 'Shalu', 100)
(5, 'Siddharth', 99)
(10, 'Babubhaiya', 99)

In [51]:
#fetchone
results=cur.execute("select min(marks) from student ")
for i in results:
    print(i)

(5,)

In [52]:
results=cur.execute("select min(marks) from student ")
results.fetchall()

[(5,)]

In [53]:
results=cur.execute("select max(marks) from student ")
results.fetchall()

[(100,)]

In [54]:
results=cur.execute("select sum(marks) from student ")
results.fetchall()

[(691,)]

In [55]:
results=cur.execute("select name from student where marks between 40 and 80")
for i in results:
    print(i)

('Mummy',)
('Kiara',)
('Alok',)

In [56]:
results=cur.execute("select count(id) from student ")
for i in results:
    print(i)

(10,)

In [57]:
results=cur.execute("select count(id) from student ")
results.fetchone()

(10,)

In [58]:
results=cur.execute("select avg(marks) from student ")
results.fetchone()

(69.1,)

In [6]:
results=cur.execute("select * from student where marks is null ")
for i in results:
    print(i)

In [8]:
results=cur.execute("select * from student where marks is not null ")
for i in results:
    print(i)

(1, 'Ram', 90)
(2, 'Shalu', 100)
(3, 'Bulbul', 5)
(4, 'Abhilash', 10)
(5, 'Siddharth', 99)
(6, 'Mummy', 40)

LIKE OPERATORS

In [10]:
results=cur.execute("select * from student where name like 'D%' ")
for i in results:
    print(i)

In [11]:
results=cur.execute("select * from student where name like 'S%' ")
for i in results:
    print(i)

(2, 'Shalu', 100)
(5, 'Siddharth', 99)

In [12]:
results=cur.execute("select * from student where name like '%y' ")
for i in results:
    print(i)

(6, 'Mummy', 40)

In [14]:
results=cur.execute("select * from student where name like '_a%' ")
for i in results:
    print(i)

(1, 'Ram', 90)

In [16]:
results=cur.execute("select * from student where name like '__a%' ")
for i in results:
    print(i)

(2, 'Shalu', 100)

In [18]:
results=cur.execute("select * from student where name like '%d%' ")
for i in results:
    print(i)

(5, 'Siddharth', 99)

In [19]:
results=cur.execute("select * from student where name like '___' ")
for i in results:
    print(i)

(1, 'Ram', 90)

In [20]:
results=cur.execute("select * from student where name like '_____' ")
for i in results:
    print(i)

(2, 'Shalu', 100)
(6, 'Mummy', 40)

In [21]:
results=cur.execute("select * from student where marks Not in (99) ")
for i in results:
    print(i)

(1, 'Ram', 90)
(2, 'Shalu', 100)
(3, 'Bulbul', 5)
(4, 'Abhilash', 10)
(6, 'Mummy', 40)

In [22]:
results=cur.execute("select * from student where name Not in ('Bulbul') ")
for i in results:
    print(i)

(1, 'Ram', 90)
(2, 'Shalu', 100)
(4, 'Abhilash', 10)
(5, 'Siddharth', 99)
(6, 'Mummy', 40)

Update the Records

In [23]:
#update the record

sql="update student set marks=80 where id=4"
cur.execute(sql)

In [25]:
results=cur.execute("select * from student where id=4")
for i in results:
    print(i)

(4, 'Abhilash', 80)

In [27]:
results=cur.execute("select * from student where id=5")
for i in results:
    print(i)

(5, 'Siddharth', 99)

In [30]:
sql="update student set marks=100 where id=5"
cur.execute(sql)
db.commit()

In [31]:
results=cur.execute("select * from student where id=5")
for i in results:
    print(i)

(5, 'Siddharth', 100)

In [32]:
results=cur.execute("select * from student")
for i in results:
    print(i)

(1, 'Ram', 90)
(2, 'Shalu', 100)
(3, 'Bulbul', 5)
(4, 'Abhilash', 80)
(5, 'Siddharth', 100)
(6, 'Mummy', 40)

In [34]:
#multiple record updates using 'IN'
sql= "update student set marks=92 where id in(5,6)"
cur.execute(sql)

In [35]:
#verify if its executed
results=cur.execute("select * from student")
for i in results:
    print(i)

(1, 'Ram', 90)
(2, 'Shalu', 100)
(3, 'Bulbul', 5)
(4, 'Abhilash', 80)
(5, 'Siddharth', 92)
(6, 'Mummy', 92)

Delete any unwanted record

In [36]:
sql= "delete from student where id=6"
cur.execute(sql)

In [37]:
results=cur.execute("select* from student")
for i in results:
    print(i)

(1, 'Ram', 90)
(2, 'Shalu', 100)
(3, 'Bulbul', 5)
(4, 'Abhilash', 80)
(5, 'Siddharth', 92)

Drop table student

In [39]:
sql="drop table student"
results=cur.execute(sql)

In [40]:
results=cur.execute("select* from student")
results.fetchall()

OperationalError: no such table: student

In [41]:
db.close()

# Adding Data in table with csv( Comma Separated Values) file directly

In [42]:
import sqlite3

In [44]:
db=sqlite3.connect("C:/MySQlite_Databse/scores_Database.db")
#Declare cursor
cursor=db.cursor()

In [48]:
#create table
cursor.execute("CREATE TABLE scores (gender TEXT,student_id INT PRIMARY KEY,marks INT)")

In [49]:
#insert record into the table single record inserting
cursor.execute("INSERT INTO scores(gender,student_id,marks) values ('male',100,500)")

#save the records permanently
db.commit()
#counts of records inserted
print(cursor.rowcount,"record(s) inserted")

1 record(s) inserted

# Inserting records from CSV

In [51]:
with open('Scores_file.csv','r') as file:
    total_records=0
    for row in file:
        cursor.execute("insert into scores values(?,?,?)", row.split(","))
        db.commit()
        total_records+=1
print(total_records,"Records=(s) Inserted")

21 Records=(s) Inserted

In [52]:
results=cursor.execute("select * from scores")
for i in results:
    print(i)

('male', 100, 500)
('male', 101, 54)
('female', 102, 75)
('female', 103, 69)
('male', 104, 55)
('male', 105, 25)
('male', 106, 100)
('female', 107, 84)
('female', 108, 74)
('male', 109, 93)
('male', 110, 41)
('male', 111, 34)
('female', 112, 39)
('female', 113, 56)
('male', 114, 69)
('male', 115, 45)
('male', 116, 58)
('female', 117, 56)
('female', 118, 58)
('male', 119, 99)
('male', 120, 78)
('trans', 121, 47)